And here is the terraform plan:

```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.project-ci-lb-http.module.project-factory.null_resource.shared_vpc_subnet_invalid_name[0]: Refreshing state... [id=905541678552877136]
module.project-ci-lb-http.module.project-factory.null_resource.preconditions: Refreshing state... [id=5575721642416739487]
module.project-ci-lb-http.module.project-factory.random_id.random_project_id_suffix: Refreshing state... [id=xPI]
module.project-ci-lb-http.module.gsuite_group.data.google_organization.org[0]: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_project_iam_member.int_test[0] will be created
  + resource "google_project_iam_member" "int_test" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ci-int-lb-http-c4f2"
      + role    = "roles/owner"
    }

  # google_project_iam_member.int_test[1] will be created
  + resource "google_project_iam_member" "int_test" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ci-int-lb-http-c4f2"
      + role    = "roles/storage.admin"
    }

  # google_service_account.int_test will be created
  + resource "google_service_account" "int_test" {
      + account_id   = "ci-int-lb-http"
      + display_name = "ci-int-lb-http"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "ci-int-lb-http-c4f2"
      + unique_id    = (known after apply)
    }

  # google_service_account_key.int_test will be created
  + resource "google_service_account_key" "int_test" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # module.project-ci-lb-http.module.project-factory.data.null_data_source.default_service_account will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "default_service_account"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "email" = (known after apply)
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.project-ci-lb-http.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + app_engine          = (known after apply)
      + auto_create_network = false
      + billing_account     = "018226-824C2D-4372EC"
      + folder_id           = "65631194888"
      + id                  = (known after apply)
      + name                = "ci-int-lb-http"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + policy_data         = (known after apply)
      + policy_etag         = (known after apply)
      + project_id          = "ci-int-lb-http-c4f2"
      + skip_delete         = (known after apply)
    }

  # module.project-ci-lb-http.module.project-factory.google_project_service.project_services[0] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ci-int-lb-http-c4f2"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.project-ci-lb-http.module.project-factory.google_project_service.project_services[1] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ci-int-lb-http-c4f2"
      + service                    = "storage-api.googleapis.com"
    }

  # module.project-ci-lb-http.module.project-factory.google_project_service.project_services[2] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ci-int-lb-http-c4f2"
      + service                    = "serviceusage.googleapis.com"
    }

  # module.project-ci-lb-http.module.project-factory.google_project_service.project_services[3] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "ci-int-lb-http-c4f2"
      + service                    = "compute.googleapis.com"
    }

  # module.project-ci-lb-http.module.project-factory.google_service_account.default_service_account will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + display_name = "ci-int-lb-http Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "ci-int-lb-http-c4f2"
      + unique_id    = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```